open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_pm_server.c
/****************************************************************************
 * chips/bk7258/cp/
 * bk7258_pm_server.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * CP side of the BK7258 peripheral clock service.  CP is the only owner of
 * sys_ctrl clock-power bits; AP requests are allow-listed and reference
 * counted per RPTUN generation.
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_PM_CLOCK

#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include <nuttx/irq.h>
#include <nuttx/rpmsg/rpmsg.h>

#include <arch/chip/bk7258_pm.h>
#include <arch/chip/bk7258_rptun.h>

#include "bk7258_pm_ipc.h"

/* The immutable v3.1.1.9 CP libdriver archive exports this function.  Its
 * enum parameters use the ordinary C int ABI.  Keep the verified numeric
 * IDs private here instead of exposing raw SDK IDs across RPMsg.
 */

extern void sys_drv_dev_clk_pwr_up(int dev, int power_up);
extern int bk_pm_module_vote_power_ctrl(unsigned int module,
                                         int power_state);
extern void sys_drv_module_power_ctrl(int module, int power_state);
extern int32_t sys_drv_module_power_state_get(int module);
extern void smem_reset_lastblock(void);
extern void sys_hal_aud_select_clock(uint32_t value);
extern void sys_hal_set_auxs_cis_clk_sel(uint32_t value);
extern void sys_hal_set_auxs_cis_clk_div(uint32_t value);
extern void sys_hal_set_cis_auxs_clk_en(uint32_t value);

#define BK7258_SDK_CLOCK_POWER_DOWN 0
#define BK7258_SDK_CLOCK_POWER_UP   1
#define BK7258_SDK_CLOCK_I2C1       0
#define BK7258_SDK_CLOCK_SPI1       1
#define BK7258_SDK_CLOCK_UART0      2
#define BK7258_SDK_CLOCK_PWM1       3
#define BK7258_SDK_CLOCK_TIMER1     4
#define BK7258_SDK_CLOCK_SARADC     5
#define BK7258_SDK_CLOCK_IRDA       6
#define BK7258_SDK_CLOCK_EFUSE      7
#define BK7258_SDK_CLOCK_I2C2       8
#define BK7258_SDK_CLOCK_SPI2       9
#define BK7258_SDK_CLOCK_UART1      10
#define BK7258_SDK_CLOCK_UART2      11
#define BK7258_SDK_CLOCK_PWM2       12
#define BK7258_SDK_CLOCK_TIMER2     13
#define BK7258_SDK_CLOCK_TIMER3     14
#define BK7258_SDK_CLOCK_OTP        15
#define BK7258_SDK_CLOCK_I2S1       16
#define BK7258_SDK_CLOCK_USB        17
#define BK7258_SDK_CLOCK_CAN        18
#define BK7258_SDK_CLOCK_PSRAM      19
#define BK7258_SDK_CLOCK_QSPI0      20
#define BK7258_SDK_CLOCK_QSPI1      21
#define BK7258_SDK_CLOCK_SDIO       22
#define BK7258_SDK_CLOCK_AUXS       23
#define BK7258_SDK_CLOCK_BTDM       24
#define BK7258_SDK_CLOCK_XVR        25
#define BK7258_SDK_CLOCK_MAC        26
#define BK7258_SDK_CLOCK_PHY        27
#define BK7258_SDK_CLOCK_JPEG       28
#define BK7258_SDK_CLOCK_DISPLAY    29
#define BK7258_SDK_CLOCK_AUDIO      30
#define BK7258_SDK_CLOCK_WATCHDOG   31
#define BK7258_SDK_CLOCK_H264       32
#define BK7258_SDK_CLOCK_I2S2       33
#define BK7258_SDK_CLOCK_I2S3       34
#define BK7258_SDK_CLOCK_YUV        35
#define BK7258_SDK_CLOCK_SLCD       36
#define BK7258_SDK_CLOCK_LIN        37

#define BK7258_SDK_POWER_MEM3       2
#define BK7258_SDK_POWER_VIDP       7
#define BK7258_SDK_POWER_BAKP_SDIO  91u
#define BK7258_SDK_POWER_AUDP_AUDIO 122u
#define BK7258_SDK_POWER_ON         0
#define BK7258_SDK_POWER_OFF        1

#ifdef CONFIG_BK7258_PM_FAULT_INJECTION
#  define BK7258_PM_FAULT_MAGIC     0x464d5042u /* "BPMF" */
#  define BK7258_PM_FAULT_VERSION   1u

struct bk7258_pm_fault_diag_s
{
  uint32_t magic;
  uint16_t version;
  uint16_t size;
  uint32_t drop_reply_count;
  uint32_t dropped_replies;
  uint32_t replayed_replies;
  uint32_t last_generation;
  uint32_t last_sequence;
};

/* This named, self-describing record is intentionally writable by a hardware
 * debugger in validation builds.  Production profiles do not contain it.
 */

volatile struct bk7258_pm_fault_diag_s g_bk7258_pm_fault_diag =
{
  .magic = BK7258_PM_FAULT_MAGIC,
  .version = BK7258_PM_FAULT_VERSION,
  .size = sizeof(struct bk7258_pm_fault_diag_s),
  .drop_reply_count = CONFIG_BK7258_PM_FAULT_INITIAL_DROP_COUNT,
};
#endif

struct bk7258_pm_server_s
{
  struct rpmsg_endpoint ept;
  volatile bool initialized;
  volatile bool endpoint_created;
  bool replay_valid;
  uint32_t generation;
  uint32_t last_sequence;
  uint16_t refs[BK7258_PM_CLOCK_COUNT];
  uint8_t freq_votes[BK7258_PM_FREQ_CLIENT_COUNT];
  bool freq_active[BK7258_PM_FREQ_CLIENT_COUNT];
  struct bk7258_pm_wire_s last_request;
  struct bk7258_pm_wire_s last_reply;
};

static struct bk7258_pm_server_s g_bk7258_pm_server;

bool bk7258_pm_server_resources_idle(void)
{
  FAR const struct bk7258_pm_server_s *priv = &g_bk7258_pm_server;
  unsigned int i;

  if (!__atomic_load_n(&priv->initialized, __ATOMIC_ACQUIRE) ||
      !__atomic_load_n(&priv->endpoint_created, __ATOMIC_ACQUIRE))
    {
      return false;
    }

  /* CP pm_idle() executes with interrupts disabled and the scheduler locked,
   * so the RPMsg worker cannot mutate these generation-owned votes here.
   */

  for (i = 0; i < BK7258_PM_CLOCK_COUNT; i++)
    {
      if (priv->refs[i] != 0)
        {
          return false;
        }
    }

  for (i = 0; i < BK7258_PM_FREQ_CLIENT_COUNT; i++)
    {
      if (priv->freq_active[i])
        {
          return false;
        }
    }

  return true;
}

static bool bk7258_pm_is_video_clock(enum bk7258_pm_clock_e clock)
{
  return clock == BK7258_PM_CLOCK_JPEG ||
         clock == BK7258_PM_CLOCK_DISPLAY ||
         clock == BK7258_PM_CLOCK_H264 ||
         clock == BK7258_PM_CLOCK_YUV ||
         clock == BK7258_PM_CLOCK_DMA2D ||
         clock == BK7258_PM_CLOCK_JPEG_DECODER ||
         clock == BK7258_PM_CLOCK_SCALE0 ||
         clock == BK7258_PM_CLOCK_SCALE1 ||
         clock == BK7258_PM_CLOCK_ROTATOR;
}

static bool bk7258_pm_video_active(struct bk7258_pm_server_s *priv)
{
  return priv->refs[BK7258_PM_CLOCK_JPEG] != 0 ||
         priv->refs[BK7258_PM_CLOCK_DISPLAY] != 0 ||
         priv->refs[BK7258_PM_CLOCK_H264] != 0 ||
         priv->refs[BK7258_PM_CLOCK_YUV] != 0 ||
         priv->refs[BK7258_PM_CLOCK_DMA2D] != 0 ||
         priv->refs[BK7258_PM_CLOCK_JPEG_DECODER] != 0 ||
         priv->refs[BK7258_PM_CLOCK_SCALE0] != 0 ||
         priv->refs[BK7258_PM_CLOCK_SCALE1] != 0 ||
         priv->refs[BK7258_PM_CLOCK_ROTATOR] != 0;
}

static void bk7258_pm_set_video_power(bool enable)
{
  if (enable &&
      sys_drv_module_power_state_get(BK7258_SDK_POWER_MEM3) ==
      BK7258_SDK_POWER_OFF)
    {
      /* v3.1.1.9 restores MEM3 before a powered-down VIDP domain.  DMA2D
       * source reads and JPEG decode both depend on this memory domain. */

      sys_drv_module_power_ctrl(BK7258_SDK_POWER_MEM3,
                                BK7258_SDK_POWER_ON);
      smem_reset_lastblock();
    }

  sys_drv_module_power_ctrl(BK7258_SDK_POWER_VIDP,
                            enable ? BK7258_SDK_POWER_ON :
                                     BK7258_SDK_POWER_OFF);
}

static void bk7258_pm_set_camera_mclk_24m(bool enable)
{
  irqstate_t flags = enter_critical_section();

  if (enable)
    {
      sys_hal_set_auxs_cis_clk_sel(3);
      sys_hal_set_auxs_cis_clk_div(19);
    }

