open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_pm_server.c
  sys_hal_set_cis_auxs_clk_en(enable ? 1 : 0);
  __asm volatile ("dmb sy" ::: "memory");
  leave_critical_section(flags);
}

static int bk7258_pm_set_clock(enum bk7258_pm_clock_e clock, bool enable)
{
  int state = enable ? BK7258_SDK_CLOCK_POWER_UP :
                       BK7258_SDK_CLOCK_POWER_DOWN;
  int ret;

  switch (clock)
    {
      case BK7258_PM_CLOCK_SDIO:
        /* The pinned AP SDK disables CONFIG_SDIO_PM_CB_SUPPORT, so its SDIO
         * path only forwards the clock edge.  In the full product other CP
         * clients can power-manage BAKP before the first card command.  Tie
         * BAKP_SDIO ownership to the cross-core SDIO clock lifetime.
         */

        if (enable)
          {
            ret = bk_pm_module_vote_power_ctrl(
                    BK7258_SDK_POWER_BAKP_SDIO,
                    BK7258_SDK_POWER_ON);
            if (ret < 0)
              {
                return ret;
              }
          }

        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_SDIO, state);

        if (!enable)
          {
            ret = bk_pm_module_vote_power_ctrl(
                    BK7258_SDK_POWER_BAKP_SDIO,
                    BK7258_SDK_POWER_OFF);
            if (ret < 0)
              {
                return ret;
              }
          }

        break;
      case BK7258_PM_CLOCK_QSPI0:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_QSPI0, state);
        break;
      case BK7258_PM_CLOCK_QSPI1:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_QSPI1, state);
        break;
      case BK7258_PM_CLOCK_CAN:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_CAN, state);
        break;
      case BK7258_PM_CLOCK_USB:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_USB, state);
        break;
      case BK7258_PM_CLOCK_ETHERNET:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_MAC, state);
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_PHY, state);
        break;
      case BK7258_PM_CLOCK_JPEG:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_JPEG, state);
        break;
      case BK7258_PM_CLOCK_DISPLAY:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_DISPLAY, state);
        break;
      case BK7258_PM_CLOCK_AUDIO:
        /* AP SDK v3.1.1.9 votes PM_POWER_SUB_MODULE_NAME_AUDP_AUDIO
         * around PM_CLK_ID_AUDIO.  The NuttX RESERVE/RELEASE audio-session
         * boundary owns this composite resource; both nested SDK operations
         * are local compatibility checks because that driver discards their
         * return values.  Preserve the official hardware order on the
         * first/last CP-owned edge without reviving the vendor mailbox PM
         * service that conflicts with NuttX RPTUN.
         */

        if (enable)
          {
            ret = bk_pm_module_vote_power_ctrl(
                    BK7258_SDK_POWER_AUDP_AUDIO,
                    BK7258_SDK_POWER_ON);
            if (ret < 0)
              {
                return ret;
              }

            /* Match the immutable common-audio driver's order while keeping
             * the shared SYS_REG clock selector on its CP owner: power the
             * AUDP domain, select XTAL, then expose the AUDIO clock.  The AP
             * compatibility wrapper turns the driver's duplicate XTAL write
             * into a no-op, avoiding the legacy mailbox AMP lock.
             */

            sys_hal_aud_select_clock(0);
          }

        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_AUDIO, state);

        if (!enable)
          {
            ret = bk_pm_module_vote_power_ctrl(
                    BK7258_SDK_POWER_AUDP_AUDIO,
                    BK7258_SDK_POWER_OFF);
            if (ret < 0)
              {
                return ret;
              }
          }

        break;
      case BK7258_PM_CLOCK_I2C1:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_I2C1, state);
        break;
      case BK7258_PM_CLOCK_SPI1:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_SPI1, state);
        break;
      case BK7258_PM_CLOCK_UART0:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_UART0, state);
        break;
      case BK7258_PM_CLOCK_PWM1:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_PWM1, state);
        break;
      case BK7258_PM_CLOCK_TIMER1:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_TIMER1, state);
        break;
      case BK7258_PM_CLOCK_SARADC:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_SARADC, state);
        break;
      case BK7258_PM_CLOCK_IRDA:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_IRDA, state);
        break;
      case BK7258_PM_CLOCK_EFUSE:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_EFUSE, state);
        break;
      case BK7258_PM_CLOCK_I2C2:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_I2C2, state);
        break;
      case BK7258_PM_CLOCK_SPI2:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_SPI2, state);
        break;
      case BK7258_PM_CLOCK_UART1:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_UART1, state);
        break;
      case BK7258_PM_CLOCK_UART2:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_UART2, state);
        break;
      case BK7258_PM_CLOCK_PWM2:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_PWM2, state);
        break;
      case BK7258_PM_CLOCK_TIMER2:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_TIMER2, state);
        break;
      case BK7258_PM_CLOCK_TIMER3:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_TIMER3, state);
        break;
      case BK7258_PM_CLOCK_OTP:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_OTP, state);
        break;
      case BK7258_PM_CLOCK_I2S1:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_I2S1, state);
        break;
      case BK7258_PM_CLOCK_PSRAM:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_PSRAM, state);
        break;
      case BK7258_PM_CLOCK_AUXS:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_AUXS, state);
        break;
      case BK7258_PM_CLOCK_BTDM:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_BTDM, state);
        break;
      case BK7258_PM_CLOCK_XVR:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_XVR, state);
        break;
      case BK7258_PM_CLOCK_MAC:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_MAC, state);
        break;
      case BK7258_PM_CLOCK_PHY:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_PHY, state);
        break;
      case BK7258_PM_CLOCK_WATCHDOG:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_WATCHDOG, state);
        break;
      case BK7258_PM_CLOCK_H264:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_H264, state);
        break;
      case BK7258_PM_CLOCK_I2S2:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_I2S2, state);
        break;
      case BK7258_PM_CLOCK_I2S3:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_I2S3, state);
        break;
      case BK7258_PM_CLOCK_YUV:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_YUV, state);
        break;
      case BK7258_PM_CLOCK_SEGMENT_LCD:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_SLCD, state);
        break;
      case BK7258_PM_CLOCK_LIN:
        sys_drv_dev_clk_pwr_up(BK7258_SDK_CLOCK_LIN, state);
        break;
      case BK7258_PM_CLOCK_CAMERA_MCLK_24M:
        /* v3.1.1.9 dvp_camera_mclk_enable(MCLK_24M): AUXS_CIS uses
         * source 3 and divider 19.  sys_ctrl is CP-owned in this port,
         * so reproduce those official SDK operations here rather than
         * allowing the immutable AP helper to write shared registers. */

        bk7258_pm_set_camera_mclk_24m(enable);
        break;
      case BK7258_PM_CLOCK_DMA2D:
        /* The immutable DMA2D driver programs its controller clocks after
         * requesting PM_POWER_SUB_MODULE_NAME_VIDP_DMA2D.  The shared VIDP
         * domain is the CP-owned resource represented by this logical vote;
         * bk7258_pm_is_video_clock() handles its first/last power edge. */

        break;
      case BK7258_PM_CLOCK_JPEG_DECODER:
        /* The immutable JPEG decoder driver configures its controller clock
         * after requesting PM_POWER_SUB_MODULE_NAME_VIDP_JPEG_DE.  The CP
         * service owns only the shared VIDP/MEM3 power edge here. */

        break;
      case BK7258_PM_CLOCK_SCALE0:
      case BK7258_PM_CLOCK_SCALE1:
      case BK7258_PM_CLOCK_ROTATOR:
        /* The immutable scale/rotator drivers configure their controller
         * clocks after voting their VIDP submodule.  CP owns only the shared
         * VIDP/MEM3 first/last power edge represented by these logical IDs. */

        break;
      default:
        break;
    }

  return OK;
}

static void bk7258_pm_release_generation(
  struct bk7258_pm_server_s *priv)
{
  bool video_active = bk7258_pm_video_active(priv);
  unsigned int i;

  for (i = 0; i < BK7258_PM_CLOCK_COUNT; i++)
    {
      if (priv->refs[i] != 0)
        {
          (void)bk7258_pm_set_clock((enum bk7258_pm_clock_e)i, false);
          priv->refs[i] = 0;
        }
    }

