open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_pm_server.c
  for (i = 0; i < BK7258_PM_FREQ_CLIENT_COUNT; i++)
    {
      if (priv->freq_active[i])
        {
          (void)bk7258_pm_frequency_vote(i,
                                         BK7258_PM_OPP_DEFAULT);
          priv->freq_active[i] = false;
          priv->freq_votes[i] = BK7258_PM_OPP_DEFAULT;
        }
    }

  if (video_active)
    {
      bk7258_pm_set_video_power(false);
    }

  priv->generation = 0;
  priv->last_sequence = 0;
  priv->replay_valid = false;
}

static bool bk7258_pm_same_request(
  FAR const struct bk7258_pm_wire_s *left,
  FAR const struct bk7258_pm_wire_s *right)
{
  return left->magic == right->magic &&
         left->version == right->version &&
         left->command == right->command &&
         left->generation == right->generation &&
         left->sequence == right->sequence &&
         left->clock == right->clock &&
         left->reserved == right->reserved;
}

static bool bk7258_pm_sequence_after(uint32_t sequence, uint32_t previous)
{
  return (int32_t)(sequence - previous) > 0;
}

#ifdef CONFIG_BK7258_PM_FAULT_INJECTION
static bool bk7258_pm_fault_drop_reply(
  FAR const struct bk7258_pm_wire_s *request)
{
  uint32_t count;

  count = __atomic_load_n(&g_bk7258_pm_fault_diag.drop_reply_count,
                          __ATOMIC_ACQUIRE);
  while (count != 0)
    {
      if (__atomic_compare_exchange_n(
            &g_bk7258_pm_fault_diag.drop_reply_count, &count, count - 1,
            false, __ATOMIC_ACQ_REL, __ATOMIC_ACQUIRE))
        {
          __atomic_fetch_add(&g_bk7258_pm_fault_diag.dropped_replies, 1,
                             __ATOMIC_RELAXED);
          g_bk7258_pm_fault_diag.last_generation = request->generation;
          g_bk7258_pm_fault_diag.last_sequence = request->sequence;
          return true;
        }
    }

  return false;
}

static void bk7258_pm_fault_record_replay(
  FAR const struct bk7258_pm_wire_s *request)
{
  __atomic_fetch_add(&g_bk7258_pm_fault_diag.replayed_replies, 1,
                     __ATOMIC_RELAXED);
  g_bk7258_pm_fault_diag.last_generation = request->generation;
  g_bk7258_pm_fault_diag.last_sequence = request->sequence;
}
#endif

static int bk7258_pm_send_rejection(
  struct bk7258_pm_server_s *priv,
  FAR const struct bk7258_pm_wire_s *request, int status)
{
  struct bk7258_pm_wire_s reply;

  memcpy(&reply, request, sizeof(reply));
  reply.command = BK7258_PM_COMMAND_RESPONSE;
  reply.status = status;
  reply.refcount = 0;
  reply.reserved = 0;
  return rpmsg_trysend(&priv->ept, &reply, sizeof(reply));
}

static int bk7258_pm_server_cb(FAR struct rpmsg_endpoint *ept,
                               FAR void *data, size_t len,
                               uint32_t src, FAR void *priv_)
{
  struct bk7258_pm_server_s *priv = priv_;
  volatile struct bk7258_rptun_control_s *control =
    bk7258_rptun_control();
  struct bk7258_pm_wire_s reply;
  FAR const struct bk7258_pm_wire_s *request = data;
  enum bk7258_pm_clock_e clock;
  struct bk7258_pm_frequency_status_s frequency_status;
  bool clock_command;
  int status = OK;

  (void)ept;
  (void)src;

  if (len != sizeof(*request) || request->magic != BK7258_PM_MAGIC ||
      request->version != BK7258_PM_VERSION || request->generation == 0 ||
      request->sequence == 0 ||
      request->generation != control->generation)
    {
      return -EINVAL;
    }

  clock_command = request->command == BK7258_PM_COMMAND_CLOCK_GET ||
                  request->command == BK7258_PM_COMMAND_CLOCK_PUT;
  if ((clock_command && request->clock >= BK7258_PM_CLOCK_COUNT) ||
      (request->command == BK7258_PM_COMMAND_CPU_FREQ_VOTE &&
       (request->clock >= BK7258_PM_FREQ_CLIENT_COUNT ||
        request->reserved > BK7258_PM_OPP_DEFAULT)))
    {
      return -EINVAL;
    }

  if (priv->generation != request->generation)
    {
      bk7258_pm_release_generation(priv);
      priv->generation = request->generation;
    }

  /* A request is committed before its response is sent.  If AP loses that
   * response, it retransmits the identical generation/sequence tuple.  Replay
   * the cached response without applying the clock reference or frequency
   * vote again.  A reused sequence carrying different contents is a protocol
   * violation; an older sequence is stale.  Both are rejected without side
   * effects.
   */

  if (priv->replay_valid)
    {
      if (request->sequence == priv->last_sequence)
        {
          if (!bk7258_pm_same_request(request, &priv->last_request))
            {
              return bk7258_pm_send_rejection(priv, request, -EPROTO);
            }

#ifdef CONFIG_BK7258_PM_FAULT_INJECTION
          bk7258_pm_fault_record_replay(request);
          if (bk7258_pm_fault_drop_reply(request))
            {
              return OK;
            }
#endif
          return rpmsg_trysend(&priv->ept, &priv->last_reply,
                               sizeof(priv->last_reply));
        }

      if (!bk7258_pm_sequence_after(request->sequence,
                                    priv->last_sequence))
        {
          return bk7258_pm_send_rejection(priv, request, -ESTALE);
        }
    }

  clock = (enum bk7258_pm_clock_e)request->clock;
  if (request->command == BK7258_PM_COMMAND_CLOCK_GET)
    {
      if (priv->refs[clock] == UINT16_MAX)
        {
          status = -EOVERFLOW;
        }
      else
        {
          if (priv->refs[clock] == 0)
            {
              if (bk7258_pm_is_video_clock(clock) &&
                  !bk7258_pm_video_active(priv))
                {
                  bk7258_pm_set_video_power(true);
                }

              status = bk7258_pm_set_clock(clock, true);
            }

          if (status >= 0)
            {
              priv->refs[clock]++;
            }
        }
    }
  else if (request->command == BK7258_PM_COMMAND_CLOCK_PUT)
    {
      if (priv->refs[clock] == 0)
        {
          status = -EALREADY;
        }
      else
        {
          if (priv->refs[clock] == 1)
            {
              status = bk7258_pm_set_clock(clock, false);
              if (status >= 0)
                {
                  priv->refs[clock] = 0;
                  if (bk7258_pm_is_video_clock(clock) &&
                      !bk7258_pm_video_active(priv))
                    {
                      bk7258_pm_set_video_power(false);
                    }
                }
            }
          else
            {
              priv->refs[clock]--;
            }
        }
    }
  else if (request->command == BK7258_PM_COMMAND_CPU_FREQ_VOTE)
    {
      status = bk7258_pm_frequency_vote(request->clock,
        (enum bk7258_pm_cpu_freq_e)request->reserved);
      if (status == 0)
        {
          priv->freq_votes[request->clock] = request->reserved;
          priv->freq_active[request->clock] =
            request->reserved != BK7258_PM_OPP_DEFAULT;
        }
    }
#ifdef CONFIG_BK7258_PM_SOFT_OFF
  else if (request->command == BK7258_PM_COMMAND_SOFT_OFF_STATUS)
    {
      status = bk7258_pm_soft_off_status();
    }
  else if (request->command == BK7258_PM_COMMAND_SOFT_OFF)
    {
      status = bk7258_pm_soft_off_request();
    }
#endif
  else if (request->command == BK7258_PM_COMMAND_CPU_FREQ_QUERY)
    {
      status = bk7258_pm_frequency_get_status(&frequency_status);
    }
  else
    {
      status = -ENOTSUP;
    }

