open-vela/contest2026_441_buzhidaojiaoshenmemingzi/chips/bk7258/cp/bk7258_pm_server.c
  memcpy(&reply, request, sizeof(reply));
  reply.command = BK7258_PM_COMMAND_RESPONSE;
  reply.status = status;
  reply.refcount = clock_command ? priv->refs[clock] : 0;

  if (status >= 0 &&
      (request->command == BK7258_PM_COMMAND_CPU_FREQ_VOTE ||
       request->command == BK7258_PM_COMMAND_CPU_FREQ_QUERY))
    {
      if (request->command == BK7258_PM_COMMAND_CPU_FREQ_VOTE)
        {
          /* The vote is already committed.  A failure to collect its
           * optional diagnostic snapshot must not turn that committed
           * operation into an error reply and make AP retry it as new.
           */

          status = bk7258_pm_frequency_get_status(&frequency_status);
        }

      if (status >= 0)
        {
          reply.clock = frequency_status.transitions;
          reply.refcount = frequency_status.current;
          reply.reserved = frequency_status.peak;
        }
    }

  /* Cache the committed transaction before attempting the response.  The
   * callback owns the RPTUN RX worker, so it must never wait for a TX buffer;
   * AP retries this same tuple after its bounded response timeout.
   */

  memcpy(&priv->last_request, request, sizeof(priv->last_request));
  memcpy(&priv->last_reply, &reply, sizeof(priv->last_reply));
  priv->last_sequence = request->sequence;
  priv->replay_valid = true;

#ifdef CONFIG_BK7258_PM_FAULT_INJECTION
  if (bk7258_pm_fault_drop_reply(request))
    {
      return OK;
    }
#endif

  return rpmsg_trysend(&priv->ept, &priv->last_reply,
                       sizeof(priv->last_reply));
}

static void bk7258_pm_device_created(FAR struct rpmsg_device *rdev,
                                     FAR void *priv_)
{
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  (void)priv_;
  if (cpuname == NULL || strcmp(cpuname, "ap") != 0)
    {
      return;
    }
}

static bool bk7258_pm_ns_match(FAR struct rpmsg_device *rdev,
                               FAR void *priv_, FAR const char *name,
                               uint32_t dest)
{
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  (void)priv_;
  (void)dest;
  return cpuname != NULL && strcmp(cpuname, "ap") == 0 &&
         strcmp(name, BK7258_PM_EPT_NAME) == 0;
}

static void bk7258_pm_ns_bind(FAR struct rpmsg_device *rdev,
                              FAR void *priv_, FAR const char *name,
                              uint32_t dest)
{
  struct bk7258_pm_server_s *priv = priv_;
  int ret;

  priv->ept.priv = priv;
  ret = rpmsg_create_ept(&priv->ept, rdev, name, RPMSG_ADDR_ANY, dest,
                         bk7258_pm_server_cb, NULL);
  if (ret >= 0)
    {
      __atomic_store_n(&priv->endpoint_created, true, __ATOMIC_RELEASE);
    }
}

static void bk7258_pm_device_destroy(FAR struct rpmsg_device *rdev,
                                     FAR void *priv_)
{
  struct bk7258_pm_server_s *priv = priv_;
  FAR const char *cpuname = rpmsg_get_cpuname(rdev);

  if (cpuname == NULL || strcmp(cpuname, "ap") != 0)
    {
      return;
    }

  __atomic_store_n(&priv->endpoint_created, false, __ATOMIC_RELEASE);
  bk7258_pm_release_generation(priv);
  if (priv->ept.rdev != NULL)
    {
      rpmsg_destroy_ept(&priv->ept);
    }
}

int bk7258_pm_initialize(void)
{
  struct bk7258_pm_server_s *priv = &g_bk7258_pm_server;
  bool expected = false;
  int ret;

  if (!__atomic_compare_exchange_n(&priv->initialized, &expected, true,
                                   false, __ATOMIC_ACQ_REL,
                                   __ATOMIC_ACQUIRE))
    {
      return OK;
    }

  ret = rpmsg_register_callback(priv, bk7258_pm_device_created,
                                bk7258_pm_device_destroy,
                                bk7258_pm_ns_match, bk7258_pm_ns_bind);
  if (ret < 0)
    {
      __atomic_store_n(&priv->initialized, false, __ATOMIC_RELEASE);
    }

  return ret;
}

#endif /* CONFIG_BK7258_PM_CLOCK */
